name: "image-text"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  data_param {
    source: "models/Image-Text/Data/coco_train2014_vgg_fc7_meanvectors_subMean_Random_lmdb"
    batch_size: 1500
    backend: LMDB
  }
}

layer {
  name: "test_data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  data_param {
    source: "models/Image-Text/Data/coco_train2014_vgg_fc7_meanvectors_subMean_Random_lmdb"
    batch_size: 128
    backend: LMDB
  }
}

## slip image and text features
layer {
  name: "slice"
  type: "Slice"
  bottom: "data"
  top: "img_data"
  top: "text_data"
  slice_param {
    slice_dim: 1
    slice_point: 4096
  }
}

## image branch
layer {
  name: "img_fc1"
  type: "InnerProduct"
  bottom: "img_data"
  top: "img_fc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "img_relu1"
  type: "ReLU"
  bottom: "img_fc1"
  top: "img_fc1"
}
layer {
  name: "img_drop1"
  type: "Dropout"
  bottom: "img_fc1"
  top: "img_fc1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "img_fc2"
  type: "InnerProduct"
  bottom: "img_fc1"
  top: "img_fc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "img_relu2"
  type: "ReLU"
  bottom: "img_fc2"
  top: "img_fc2"
}
layer {
  name: "img_drop2"
  type: "Dropout"
  bottom: "img_fc2"
  top: "img_fc2"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "img_fc3"
  type: "InnerProduct"
  bottom: "img_fc2"
  top: "img_fc3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
   bottom: "img_fc3"
   top: "img_bnorm"
   name: "img_bnorm"
   type: "BatchNorm"
   batch_norm_param {
     use_global_stats: false
   }
}
layer {
   bottom: "img_bnorm"
   top: "img_bnorm"
   name: "scale_img_bnorm"
   type: "Scale"
   param {
     lr_mult: 1
     decay_mult: 1
   }
   param {
     lr_mult: 2
     decay_mult: 0
   }
   scale_param {
     bias_term: true
   }
}
layer {
  name: "img_l2norm"
  type: "Norm"
  bottom: "img_bnorm"
  top: "img_l2norm"
}

## text branch
layer {
  name: "text_fc1"
  type: "InnerProduct"
  bottom: "text_data"
  top: "text_fc1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "text_relu1"
  type: "ReLU"
  bottom: "text_fc1"
  top: "text_fc1"
}
layer {
  name: "text_drop1"
  type: "Dropout"
  bottom: "text_fc1"
  top: "text_fc1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "text_fc2"
  type: "InnerProduct"
  bottom: "text_fc1"
  top: "text_fc2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "text_relu2"
  type: "ReLU"
  bottom: "text_fc2"
  top: "text_fc2"
}
layer {
  name: "text_drop2"
  type: "Dropout"
  bottom: "text_fc2"
  top: "text_fc2"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "text_fc3"
  type: "InnerProduct"
  bottom: "text_fc2"
  top: "text_fc3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 512
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
   bottom: "text_fc3"
   top: "text_bnorm"
   name: "text_bnorm"
   type: "BatchNorm"
   batch_norm_param {
     use_global_stats: false
   }
}
layer {
   bottom: "text_bnorm"
   top: "text_bnorm"
   name: "scale_text_bnorm"
   type: "Scale"
   param {
     lr_mult: 1
     decay_mult: 1
   }
   param {
     lr_mult: 2
     decay_mult: 0
   }
   scale_param {
     bias_term: true
   }
}
layer {
  name: "text_l2norm"
  type: "Norm"
  bottom: "text_bnorm"
  top: "text_l2norm"
}

layer {
  name: "loss"
  type: "OneDirectionalLoss"
  bottom: "img_l2norm"
  bottom: "label"
  bottom: "text_l2norm"
  bottom: "label"
  top: "loss"
  rank_param{
    neg_num: 50
    pair_size: 1
    hard_ratio: 1
    rand_ratio: 0
    margin: 0.1
  }
}


